[
  {
    "slug": "resp-strategies-maximize-cesg",
    "title": "RESP Strategies: Maximize the CESG Before Your Kids Turn 18",
    "description": "How to maximize the Canada Education Savings Grant (CESG) with optimal RESP contribution strategies, catch-up rules, provider comparisons, and what happens if your child doesn't go to school.",
    "author": "Rick Minji",
    "date": "2026-02-25",
    "readTime": "11 min read",
    "category": "Education Planning",
    "tags": [
      "RESP",
      "CESG",
      "Canada Learning Bond",
      "Education Savings",
      "RESP Providers",
      "Education Planning"
    ],
    "excerpt": "The CESG gives you free money — up to $7,200 per child — but only if you contribute strategically. We break down optimal contribution schedules, catch-up rules, provider types, and what happens if your child skips post-secondary."
  },
  {
    "slug": "lease-vs-buy-car-canada",
    "title": "Lease vs Buy a Car in Canada: The Real Math",
    "description": "Total cost comparison of leasing vs buying a car in Canada. Hidden costs, tax implications for personal and business use, EV incentives, and a decision framework.",
    "author": "Rick Minji",
    "date": "2026-02-25",
    "readTime": "12 min read",
    "category": "Auto & Lifestyle",
    "tags": [
      "Lease vs Buy",
      "Car Lease Canada",
      "Auto Finance",
      "EV Incentives",
      "Vehicle Tax Deduction",
      "iZEV"
    ],
    "excerpt": "Leasing feels cheaper monthly but is it really? We run the full 6-year cost comparison on a $45K vehicle — lease vs finance vs cash — including hidden fees, tax write-offs, EV rebates, and depreciation curves."
  },
  {
    "slug": "net-worth-by-age-canada",
    "title": "Net Worth by Age in Canada: Where Do You Stand?",
    "description": "Canadian net worth benchmarks by age group using 2023 Statistics Canada data. Median vs average, regional differences, homeowner vs renter gap, and strategies to grow at every life stage.",
    "author": "Rick Minji",
    "date": "2026-02-25",
    "readTime": "12 min read",
    "category": "Financial Planning",
    "tags": [
      "Net Worth",
      "Net Worth by Age",
      "Statistics Canada",
      "Financial Benchmarks",
      "Wealth Building",
      "Financial Planning"
    ],
    "excerpt": "The median Canadian family has a net worth of $519,700 — but that number varies wildly by age, region, and homeownership. See where you stand with 2023 Stats Canada data and get strategies for every life stage."
  },
  {
    "slug": "gic-rates-canada-2026",
    "title": "GIC Rates in Canada 2026: Are They Still Worth It (and When to Lock In)",
    "description": "GIC rates in Canada are falling as the Bank of Canada cuts rates. Are GICs still worth it in 2026? Cashable vs non-redeemable, GIC laddering strategy, when GICs beat bonds and HISAs, and tax treatment.",
    "author": "Rick Minji",
    "date": "2026-02-19",
    "readTime": "11 min read",
    "category": "Investment Planning",
    "tags": [
      "GIC Rates",
      "GIC Canada",
      "GIC Ladder",
      "Cashable GIC",
      "Non-Redeemable GIC",
      "Bank of Canada",
      "Investment Planning"
    ],
    "excerpt": "GIC rates in Canada are heading down after the Bank of Canada's aggressive rate-cutting cycle. With rates now in the 3.25%–4.25% range, are GICs still worth it? We break down cashable vs non-redeemable, the GIC laddering strategy, when GICs beat HISAs and bonds, and optimal tax treatment in registered vs non-registered accounts."
  },
  {
    "slug": "cpp-start-age-canada",
    "title": "CPP at 60, 65, or 70? How to Decide When to Start Collecting",
    "description": "Should you take CPP at 60, 65, or 70? Breakeven analysis, 2026 payment amounts, impact of working while collecting, pension sharing, OAS/GIS interaction, and health considerations.",
    "author": "Rick Minji",
    "date": "2026-02-19",
    "readTime": "12 min read",
    "category": "Retirement Planning",
    "tags": [
      "CPP",
      "Canada Pension Plan",
      "CPP Breakeven",
      "Early CPP",
      "Delayed CPP",
      "Retirement Planning",
      "OAS",
      "GIS"
    ],
    "excerpt": "The Canada Pension Plan start-age decision is one of the most consequential financial choices a Canadian retiree will make. The max CPP at 65 in 2026 is $1,364.60/month — take it at 60 and you get 36% less; wait until 70 and you get 42% more. We run the breakeven analysis, cover working while collecting, pension sharing, OAS/GIS interaction, and build a decision framework."
  },
  {
    "slug": "rrsp-deadline-2026",
    "title": "RRSP Deadline 2026: Last-Minute Strategies Before March 3rd",
    "description": "The RRSP contribution deadline for the 2025 tax year is March 3, 2026. Last-minute strategies including RRSP loans, spousal contributions, carry-forward deductions, and how to coordinate with TFSA and FHSA.",
    "author": "Rick Minji",
    "date": "2026-02-17",
    "readTime": "11 min read",
    "category": "Tax Planning",
    "tags": [
      "RRSP",
      "RRSP Deadline",
      "Tax Deduction",
      "Spousal RRSP",
      "Contribution Room",
      "Tax Planning"
    ],
    "excerpt": "The RRSP contribution deadline for the 2025 tax year is March 3, 2026. Whether you have $500 or $50,000 in contribution room, last-minute strategies like RRSP loans, spousal contributions, and carry-forward deductions can save you thousands. Here's your two-week game plan."
  },
  {
    "slug": "canada-mortgage-rules-2025-2026",
    "title": "Canada's New Mortgage Rules: What the 2025-2026 Changes Mean for Buyers",
    "description": "Canada's biggest mortgage rule changes in a decade took effect in late 2024, expanding 30-year amortizations for first-time buyers, raising the insured mortgage cap to $1.5M, and opening secondary suite refinancing. Here's what every Canadian buyer and homeowner needs to know heading into spring 2026.",
    "author": "Rick Minji",
    "date": "2026-02-16",
    "readTime": "12 min read",
    "category": "Real Estate",
    "tags": [
      "Mortgage Rules",
      "30-Year Amortization",
      "Insured Mortgage",
      "Stress Test",
      "CMHC",
      "First-Time Buyer",
      "Canadian Mortgage"
    ],
    "excerpt": "Canada's biggest mortgage rule changes in a decade took effect in late 2024, expanding 30-year amortizations for first-time buyers, raising the insured mortgage cap to $1.5M, and opening secondary suite refinancing. Here's what every Canadian buyer and homeowner needs to know heading into spring 2026."
  },
  {
    "slug": "mortgage-renewal-canada-2026",
    "title": "Mortgage Renewal in 2026: What Every Canadian Needs to Know",
    "description": "Complete guide to renewing your mortgage in Canada in 2026. Payment shock calculations, fixed vs variable rates, switching lenders, penalty math, and strategies to prepare.",
    "author": "Rick Minji",
    "date": "2026-02-14",
    "readTime": "12 min read",
    "category": "Real Estate",
    "tags": [
      "Mortgage Renewal",
      "Mortgage Rates",
      "Fixed vs Variable",
      "Mortgage Penalty",
      "Canadian Mortgage"
    ],
    "excerpt": "Roughly 1.2 million Canadian mortgages are up for renewal in 2026, and most borrowers face rates 2-3 percentage points higher than what they're paying. A $500K mortgage going from 1.89% to 4.5% means ~$700/month more. Here's how to prepare, negotiate, and minimize the impact."
  },
  {
    "slug": "capital-gains-tax-canada-2026",
    "title": "What Canadians Get Wrong About Capital Gains Tax (2026 Update)",
    "description": "Comprehensive guide to Canadian capital gains tax in 2026. The new inclusion rate, principal residence exemption, LCGE, worked examples, and strategies to minimize your tax bill.",
    "author": "Rick Minji",
    "date": "2026-02-13",
    "readTime": "11 min read",
    "category": "Tax Planning",
    "tags": [
      "Capital Gains",
      "Inclusion Rate",
      "Principal Residence",
      "LCGE",
      "Tax Planning"
    ],
    "excerpt": "The 2024 capital gains inclusion rate change confused a lot of Canadians. Here's what actually changed: individuals pay 50% inclusion on the first $250K of gains per year and 66.67% above that. We bust the myths, run worked examples, and show you how to legally minimize what you owe."
  },
  {
    "slug": "cost-raising-child-canada-2026",
    "title": "The True Cost of Raising a Child in Canada (2026 Edition)",
    "description": "Complete breakdown of raising a child in Canada from birth to 18. Includes provincial costs, CCB benefits, RESP strategies, and real cost estimates by age bracket.",
    "author": "Rick Minji",
    "date": "2026-02-13",
    "readTime": "13 min read",
    "category": "Family Finance",
    "tags": [
      "Child Costs",
      "CCB",
      "Canada Child Benefit",
      "RESP",
      "CESG",
      "Childcare",
      "Family Budget",
      "Parenting"
    ],
    "excerpt": "Raising a child from birth to age 18 in Canada costs approximately $293,000 to $350,000, depending on your province and lifestyle choices. However, with the Canada Child Benefit (CCB) providing up to $180,000 over 18 years and smart RESP contributions capturing $7,200 in free government money, the net cost ranges from $113,000 to $170,000."
  },
  {
    "slug": "retirement-savings-canada-2026",
    "title": "How Much Do You Really Need to Retire in Canada? The 2026 Numbers",
    "description": "Comprehensive guide to retirement savings in Canada for 2026. Learn about CPP, OAS, GIS, provincial cost differences, and how much you need for modest, comfortable, or affluent retirement.",
    "author": "Rick Minji",
    "date": "2026-02-13",
    "readTime": "14 min read",
    "category": "Retirement Planning",
    "tags": [
      "Retirement",
      "CPP",
      "OAS",
      "GIS",
      "Retirement Savings",
      "Financial Planning",
      "Canadian Finance"
    ],
    "excerpt": "Most Canadians will need between $400,000 and $1.2 million in retirement savings (excluding their home) to maintain their lifestyle, depending on their province and spending level. When combined with CPP and OAS, this translates to a retirement income ranging from $35,000 to $80,000+ annually."
  },
  {
    "slug": "fhsa-vs-rrsp-first-home",
    "title": "FHSA vs RRSP for Your First Home: Which Should You Max Out First?",
    "description": "Comparing FHSA ($8K/year, $40K lifetime) vs RRSP HBP ($60K withdrawal) for first-time home buyers. Worked examples at $50K, $80K, $120K income with decision flowchart and optimal strategies.",
    "author": "Rick Minji",
    "date": "2026-02-13",
    "readTime": "12 min read",
    "category": "Real Estate",
    "tags": [
      "FHSA",
      "RRSP",
      "Home Buyers Plan",
      "HBP",
      "First Home Savings Account",
      "First Home",
      "Down Payment",
      "Tax Planning"
    ],
    "excerpt": "Choosing between maxing your FHSA or RRSP for your first home down payment can save you thousands. We compare contribution limits ($8K vs $40K lifetime), tax treatment, repayment rules, and show worked examples at three income levels to help you decide which account to prioritize."
  },
  {
    "slug": "rrsp-vs-tfsa-2026",
    "title": "RRSP vs TFSA in 2026: Which Should Canadians Max Out First?",
    "description": "Discover whether to prioritize RRSP or TFSA contributions in 2026. Compare contribution limits, tax benefits, and income-based strategies to maximize your Canadian retirement savings.",
    "author": "Rick Minji",
    "date": "2026-02-10",
    "readTime": "12 min read",
    "category": "Retirement Planning",
    "tags": [
      "RRSP",
      "TFSA",
      "Retirement",
      "Tax Planning",
      "Canadian Finance"
    ],
    "excerpt": "Choosing between maximizing your RRSP or TFSA is one of the most common financial dilemmas facing Canadians. Both are powerful savings vehicles, but they work very differently—and the right choice depends heavily on your current income, future plans, and financial goals."
  },
  {
    "slug": "canadian-tax-brackets-2026",
    "title": "2026 Canadian Tax Brackets Explained: Federal + Every Province",
    "description": "Complete 2026 Canadian tax brackets guide covering federal rates plus all 10 provinces and 3 territories. Includes CPP2 changes, basic personal amounts, and tax planning strategies.",
    "author": "Rick Minji",
    "date": "2026-02-08",
    "readTime": "10 min read",
    "category": "Tax Planning",
    "tags": [
      "Tax Brackets",
      "Canadian Tax",
      "Tax Planning",
      "Provincial Tax",
      "CPP"
    ],
    "excerpt": "Understanding Canadian tax brackets is essential for effective tax planning. In 2026, federal and provincial tax rates continue to evolve, with CPP2 enhancements and indexed basic personal amounts affecting your take-home pay."
  },
  {
    "slug": "first-time-home-buyer-2026",
    "title": "First-Time Home Buyer's Guide to Canada in 2026",
    "description": "Complete 2026 guide for Canadian first-time home buyers. Learn about FHSA, HBP, down payment strategies, CMHC insurance, stress test rules, and provincial rebates to buy your first home.",
    "author": "Rick Minji",
    "date": "2026-02-05",
    "readTime": "11 min read",
    "category": "Real Estate",
    "tags": [
      "First Home",
      "FHSA",
      "Home Buyers Plan",
      "CMHC",
      "Mortgage",
      "Real Estate"
    ],
    "excerpt": "Buying your first home in Canada can feel overwhelming, but 2026 brings several helpful programs including the First Home Savings Account (FHSA), enhanced Home Buyers' Plan, and provincial incentives that can make homeownership more accessible."
  },
  {
    "slug": "debt-payoff-strategies-canada",
    "title": "Avalanche vs Snowball: The Best Debt Payoff Strategy for Canadians",
    "description": "Avalanche vs Snowball debt payoff methods explained for Canadians. Learn which strategy works best for student loans, credit cards, and LOCs in 2026's interest rate environment.",
    "author": "Rick Minji",
    "date": "2026-02-03",
    "readTime": "9 min read",
    "category": "Debt Management",
    "tags": [
      "Debt Payoff",
      "Avalanche Method",
      "Snowball Method",
      "Student Loans",
      "Credit Cards"
    ],
    "excerpt": "When you're carrying multiple debts—credit cards, student loans, car payments, lines of credit—choosing the right payoff strategy can save you thousands in interest and help you become debt-free faster. The two most popular approaches are the Avalanche and Snowball methods."
  },
  {
    "slug": "small-business-valuation-canada",
    "title": "How to Value a Small Business in Canada: A Practical Guide",
    "description": "Learn how to value a small business in Canada using DCF, comparable multiples, and asset-based methods. Includes industry rules of thumb, goodwill calculations, and CRA tax implications.",
    "author": "Rick Minji",
    "date": "2026-02-01",
    "readTime": "13 min read",
    "category": "Business Finance",
    "tags": [
      "Business Valuation",
      "Small Business",
      "DCF",
      "M&A",
      "Canadian Business"
    ],
    "excerpt": "Whether you're buying, selling, or seeking funding for a small business in Canada, understanding valuation is critical. Business valuation combines art and science—blending financial analysis with industry knowledge and market conditions."
  }
]